# CircularDependencyAssocPropError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RegenFailures..::..CircularDependencyAssocPropError Property
BuiltInFailures..::..RegenFailures Class See Also
---
There is a circular dependency between a Line created with Pick Support and the supporting member.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CircularDependencyAssocPropError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CircularDependencyAssocPropError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CircularDependencyAssocPropError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RegenFailures Class
Autodesk.Revit.DB Namespace